common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status_id' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=1) AND (`status_id`=10)